{
  "recipeId": "kalakand",
  "recipeName": "Kalakand",
  "recipeSmallImageUrl": "recipe_small_image.JPG",
  "recipeLargeImageUrl": "recipe_big_image.JPG",
  "recipeDescriptionLines": [
    {
      "recipeDescriptionLine": "Kalakand is one of the very known sweets made in India during festivals and other occasions. It is made from thickened milk and cottage cheese."
    },
    {
      "recipeDescriptionLine": "A large quantity of milk is boiled and then cooked on a medium flame till it gradually thickens. Fresh paneer (cottage cheese) is preferred for the delicious taste. The recipe is very easy however lengthy if made from scratch."
    },
    {
      "recipeDescriptionLine": "Nowadays, quicker ways are available to make this sweet and so are  different flavors like the famous Anjeeri Kalakand."
    }
  ],
  "preface": "Sweets made with milk are my favorites so it tempted me to make this one. I made this dish right from scratch. You need lot of patience while making it even though its quite simple to make",
  "servings": "Makes 8-10 Kalakand",
  "prepTime": "15 mins",
  "cookTime": "2 hrs",
  "ingredients": [
    {
      "ingredientGrpId": 0,
      "ingredientTitle": "",
      "ingredientList": [
        {
          "ingredientName": "Milk",
          "measurementQuantity": "2 ltrs"
        },
        {
          "ingredientName": "Lemon",
          "measurementQuantity": "1, juice extracted"
        },
        {
          "ingredientName": "Sugar",
          "measurementQuantity": "1 and half cup (or as desired)"
        },
        {
          "ingredientName": "Saffron (optional)",
          "measurementQuantity": "10 strands"
        },
        {
          "ingredientName": "Muslin or cheese cloth",
          "measurementQuantity": "To drain water from cheese"
        },
        {
          "ingredientName": "Pistachio",
          "measurementQuantity": "For garnish"
        }
      ]
    }
  ],
  "cookingProcedures": [
    {
      "procedureName": "",
      "procedureSteps": [
        {
          "stepDescription": "Divide milk into 2 equal portion. One part will be used to make Paneer (cottage cheese)  and another to make Khoya (Khoa).",
          "stepImages": []
        },
        {
          "stepDescription": "For making Khoya, shift the milk to a  heavy bottom vessel (I used small cooker) on a medium flame. Once the milk comes to boil, reduce the flame to low and simmer, keep stirring until the milk reduces to 1/4 of the original quantity. Once done, keep it aside. Keep an eye on this step because milk should be burnt at all. This step really needs patience. This step will take  1 hr 30 mins approx.",
          "stepImages": [
            {
              "ImageUrl": "step_2_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_2_2.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "For making Paneer (cottage cheese), boil the milk in any container. Once it comes to boil, reduce the flame to low and add lemon juice. You will see milk will start breaking and curd gets separated from whey. Wait for 5 mins and switch of the stove. Wait for few more minutes anf filter the entire content using muslin or cheese cloth. Drain the excess whey by twisting the cloth. Fresh paneer will be ready.",
          "stepImages": [
            {
              "ImageUrl": "step_3_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_3.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_4.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Crush saffron with a pinch of sugar till it is powdered. Sugar helps in easy crushing that helps in giving strong color to any dish.",
          "stepImages": []
        },
        {
          "stepDescription": "Now to Khoya, add paneer, sugar, saffron, food color (if using). Mix well. On a low flame, cook the entire content until the water is evaporated and a thick mixture is formed. This step will take 45 mins approx. Kalakand is ready.",
          "stepImages": [
            {
              "ImageUrl": "step_5_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_5_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_5_3.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_5_4.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Now pour the mixture on plate and level it. Wait for it to cool down. Cut the kalakand into desired shapes (square, circle). Garnish with pistachios and enjoy.",
          "stepImages": [
            {
              "ImageUrl": "step_6_1.JPG",
              "ImageAltText": ""
            }
          ]
        }
      ]
    }
  ],
  "tips": [
    {
      "tipDesc": "Add color to half portion of kalakand. First pour white portion of kalakand, then layer it with the other color resulting into a colorful layer of kalakand. You can use your imagination to make the dish colorful as per your choice."
    },
    {
      "tipDesc": "Also, you can add 2 tsp of ghee after switching of the stove and mix it well to enhance taste."
    }
  ]
}