{
  "recipeId": "rasmalai",
  "recipeName": "Rasmalai",
  "recipeSmallImageUrl": "recipe_small_image.JPG",
  "recipeLargeImageUrl": "recipe_big_image.JPG",
  "recipeDescriptionLines": [
    {
      "recipeDescriptionLine": "Rasmalai is a popular sweet originating in Pakistan. The name of the sweet itself has two parts, \"Ras\" means juice and \"Malai\" means cream and is made from whole milk. The more fat the milk has, more and better will be the sweet."
    },
    {
      "recipeDescriptionLine": "It is made by making fresh paneer from milk from one portion and thickened milk from remaining portion."
    },
    {
      "recipeDescriptionLine": "Rasmalai tastes best when served chilled."
    }
  ],
  "preface": "Rasmalai had always been my favorite sweet, especially because, there is no oil / ghee is used. Its been 2 years, I am making this sweet and the taste gets better and better.",
  "servings": "25 Rasmalai approx",
  "prepTime": "15 mins",
  "cookTime": "1 hr 30 mins",
  "ingredients": [
    {
      "ingredientGrpId": 0,
      "ingredientTitle": "",
      "ingredientList": [
        {
          "ingredientName": "Milk",
          "measurementQuantity": "4 ltrs"
        },
        {
          "ingredientName": "Water",
          "measurementQuantity": "500 ml"
        },
        {
          "ingredientName": "Sugar",
          "measurementQuantity": "3/4 cup (150 g) or as per taste"
        },
        {
          "ingredientName": "Lemon",
          "measurementQuantity": "1"
        },
        {
          "ingredientName": "Cardamom powder",
          "measurementQuantity": "2, finely crushed"
        },
        {
          "ingredientName": "Pistachios",
          "measurementQuantity": "For garnish"
        },
        {
          "ingredientName": "Saffron",
          "measurementQuantity": "For color factor"
        }
      ]
    }
  ],
  "cookingProcedures": [
    {
      "procedureName": "",
      "procedureSteps": [
        {
          "stepDescription": "Divide the milk into 2 equal portions. One portion will be used to make paneer and other for the thickened milk.",
          "stepImages": []
        },
        {
          "stepDescription": "For making paneer, boil the milk. Once it is boiled, reduce the flame and add lemon juice (remove seeds).",
          "stepImages": [
            {
              "ImageUrl": "step_2_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_2_2.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Keep stirring with a spoon,  lumps will be formed and keep stirring till a light green water layer is separated. Keep stirring for say about 5-7 mins. Switch of the stove. Using a cloth, drain the excess light green water, only paneer will be remaining. Keep this paneer under running water for it to cool down. Then hang it for couple of hours till all water is filtered.",
          "stepImages": [
            {
              "ImageUrl": "step_3_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_3.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_4.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Remove the paneer from cloth and using your hands, knead it well till it is soft (about 5 mins). You can use hand mixer or grinder as well (15 secs). I dont prefer grinder as it sticks to it and it takes time to remove paneer.",
          "stepImages": [
            {
              "ImageUrl": "step_4_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_4_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_4_3.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Take a small portion make a small ball (about 2 cm diameter). If you are able to make one without paneer spilling over, it means you have kneaded the dough well, otherwise you have to knead it again. After making it in round shape, gently press it to flatten it. Smoothe the cracked side. Do it for entire batch.",
          "stepImages": [
            {
              "ImageUrl": "step_5_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_5_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_5_3.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "In a pressure cooker, add warm water (around 500 ml)  and 50 g sugar.. Mix it till sugar dissolves completely. Add paneer pieces carefully. Pressure cook for 1 whistle. Let it cool down. Remove the water. The paneer size will be increased by 50% or more. Remove the pieces carefully one by one and gently press in between your palms to remove 50% water. Put it on a bowl in which you will put the dish.",
          "stepImages": [
            {
              "ImageUrl": "step_6_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_6_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_6_3.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_6_4.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "For making thickened milk, boil the remaining 2 litre milk.then reduce the flame and add sugar and crushed saffron. Always, crush saffron using a pinch of sugar using mortar and pestle. This enhances the color. Keep stirring, till quantity is reduce to half. Add cardamom and mix it well. Pour the milk on the paneer flattened balls.",
          "stepImages": [
            {
              "ImageUrl": "step_7_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_7_2.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Garnish with Pistachios. Refrigerate for minimum 6 hours before serving.",
          "stepImages": [
            {
              "ImageUrl": "step_8_1.JPG",
              "ImageAltText": ""
            }
          ]
        }
      ]
    }
  ],
  "tips": [
    {
      "tipDesc": "As you practice this dish, you can always decide on the thickness and sweetness of milk as per your choice. You can also use slightly higher portion for making paneer than for thickened milk."
    }
  ]
}