{
  "recipeId": "paanpole",
  "recipeName": "Paanpole",
  "recipeSmallImageUrl": "recipe_small_image.JPG",
  "recipeLargeImageUrl": "recipe_big_image.JPG",
  "recipeDescriptionLines": [
    {
      "recipeDescriptionLine": "Paanpole is a famous well known breakfast item among every household in Konkanis. It is a simple paper thin rice crepe that does not require any fermentation. It is also known as Neer Dosa in other parts of Karnataka."
    },
    {
      "recipeDescriptionLine": "The batter has a milk like consistency and it is enjoyed with spicy chutneys and with non veg curries as well."
    }
  ],
  "preface": "",
  "servings": "8",
  "prepTime": "15 mins",
  "cookTime": "20 mins",
  "publishDate": "2015-04-14T23:40:02.518Z",
  "ingredients": [
    {
      "ingredientGrpId": 0,
      "ingredientTitle": "",
      "ingredientList": [
        {
          "ingredientName": "Raw Rice",
          "measurementQuantity": "1 cup"
        },
        {
          "ingredientName": "Sooji (Semolina)",
          "measurementQuantity": "1 tbsp"
        },
        {
          "ingredientName": "Salt",
          "measurementQuantity": "As per taste"
        },
        {
          "ingredientName": "Water",
          "measurementQuantity": "To grind"
        },
        {
          "ingredientName": "OIl",
          "measurementQuantity": "To grease the pan"
        }
      ]
    }
  ],
  "cookingProcedures": [
    {
      "procedureName": "",
      "procedureSteps": [
        {
          "stepDescription": "Soak the rice for 4-6 hours. You can keep it overnight as well. Make a fine paste in grinder along with sooji. Rub a little batter in between your fingers, it should not be grainy. If it is, grind it again till you get a fine paste. Add water till you reach milk like consistency. Add salt. Mix it well. The batter is ready.",
          "stepImages": [
            {
              "ImageUrl": "step_1_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_1_2.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Generally Paanpole is made on an iron skillet, but if you don't have one, use non-stick pan. Heat the skillet or pan. Grease it with oil. Before pouring batter, always make sure to mix the batter, because rice has a tendency to settle down. Pour the batter evenly on the pan, and cover it immediately with a lid so that the moisture doesn't get lost.",
          "stepImages": [
            {
              "ImageUrl": "step_2_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_2_2.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_2_3.JPG",
              "ImageAltText": ""
            }
          ]
        },
        {
          "stepDescription": "Cook it for a minute. Remove the lid, wait for 30 secs and flip it and let the other side cook for 1 min. Keep it aside on a plate. One thing to remember is always place paanpole on top of each other when its cool down, hot ones tend to stick.",
          "stepImages": [
            {
              "ImageUrl": "step_3_1.JPG",
              "ImageAltText": ""
            },
            {
              "ImageUrl": "step_3_2.JPG",
              "ImageAltText": ""
            }
          ]
        }
      ]
    }
  ],
  "tips": [
    {
      "tipDesc": "If you are a non-vegetarian, you can also add one egg instead if sooji while grinding. Even an egg helps preventing the batter from sticking to the pan."
    },
    {
      "tipDesc": "The batter can be stored in refrigerator. But while using it to make fresh paanpole, the batter should be at room temperature."
    }
  ]
}