{
  "recipeId": "tea",
  "recipeName": "Tea",
  "recipeSmallImageUrl": "recipe_small_image.JPG",
  "recipeLargeImageUrl": "recipe_big_image.JPG",
  "recipeDescriptionLines": [
    {
      "recipeDescriptionLine": "Chai or Tea, a famous Indian hot beverage is a blend of black tea and Indian herbs and spices and is made by brewing it together. It is essential part of breakfasts and evening snack time. But, people love to drink it anywhere anytime."
    },
    {
      "recipeDescriptionLine": "Ginger tea is one of the form where it is crushed and brewed along with tea to release it aroma and taste. Ginger has its own medicinal value and is good for sore throat."
    },
    {
      "recipeDescriptionLine": "Other popular forms of hot tea is Cardamom tea where crushed cardamom is used and Masala tea, which can be made either by using ready made Chai Masala available in stores or by adding cloves, peppercorns while brewing."
    }
  ],
  "preface": "",
  "servings": "2",
  "prepTime": "1 min",
  "cookTime": "10 mins",
  "publishDate": "2014-11-06T07:21:15.197Z",
  "ingredients": [
    {
      "ingredientGrpId": 0,
      "ingredientTitle": "",
      "ingredientList": [
        {
          "ingredientName": "Water",
          "measurementQuantity": "3/4 cup"
        },
        {
          "ingredientName": "Milk",
          "measurementQuantity": "3/4 cup"
        },
        {
          "ingredientName": "Sugar",
          "measurementQuantity": "2 tbsp"
        },
        {
          "ingredientName": "Tea Powder",
          "measurementQuantity": "1 tbsp"
        },
        {
          "ingredientName": "GInger",
          "measurementQuantity": "1 tbsp, crushed"
        }
      ]
    }
  ],
  "cookingProcedures": [
    {
      "procedureName": "",
      "procedureSteps": [
        {
          "stepDescription": "Add sugar, tea powder and crushed ginger to water. Allow it to boil on a medium flame. It takes 1-2 min. The tea will be black in color now.",
          "stepImages": []
        },
        {
          "stepDescription": "Once boiled, add milk. Once it comes to boil, allow it for 1 more minute to boil. Switch off the stove. Filter the tea using strainer. Enjoy hot.",
          "stepImages": []
        }
      ]
    }
  ],
  "tips": [
    {
      "tipDesc": "There are many variations that you can do while preparing tea. The famous Cardamon tea: use 1 crushed cardamom, instead of ginger. If you like strong flavor add one more. Masala Chai: Use 2 pinch of Chai Masala instead of ginger. Some people use cloves and peppercorns too."
    }
  ]
}